//контролируемые и не контролируемые виды формы
//контролируемый - привязывается к определ ному значению или св-ву
//такой компонент всегда отображает то значение что содержит свойство и у пользователя нет возможности изменять это значение
// class Search extends Component {
//     render() {
//         return (
//             <div>
//                 Search Term: <input type="search" value="React"/>
//             </div>
//         )
//     }
// }
// //особые случаи
// //значение пишеться в value
// <textarea value="text"/>

// <select value="b"/>
// //та выбирается текущий выбранный элемент select

//не контролируемые компонеты(антипаттерн)
//протиаоречит принципам реакта так как ререндеринг не происходит




