//клиентский js

//самый главны объект в браузере window окно браузера
//window.window ссылка на самого себя
//сойство location это ссылка на объект с именем Location этот объект определяет адрес текущей страницы браузера URL
//window.location = 'http://www.o.by' браузер перейдет на эту страницу

//методы window
//alert();
//setTimeout() -таймер для выполнения программы через заданный промежуток времени
//setTimeout(funcion() {alert('hello');}, 2000);

//вбраузере winow это global object

//свойство document которое ссылается на объект Document
//этот объект очень важный формирует то что мы видим в браузере
//есть метод getElementById() возвращает объект типа Element ии он тоже содержит набор свойств и методов который
//позволяет работать с содержимым объекта element позволяет изменять его атрибуды и выполнять операции разные
//наример у объекта element есть свойства style и classNmae которые позволяют применить css стили к этому элементу

//свойства обоаботки событий event handler properties есть и у document и у window и  element
//эти св-ав позволяют задать ф-цию которая будет вызвана на исполнение в асинхронном режиме автоматически в случае возникновения какого
//либо события

//в именах этих св-в как правило присутствует префикс on
//onclick
//onload - уобъекта window когда страница загружена

//

